{
    "name": "Titanic Disaster Analysis",
    "version": "0.1",
    "short_description": "Titanic Disaster Analysis using Tensorflow for demonstration of Patra Model Cards.",
    "full_description": "We have trained a ML model using the tensorflow framework to predict profit for Titanic Disaster Analysis dataset. We leverage this data to run the Patra model cards to capture metadata about the model as well as fairness and explainability metrics.",
    "keywords": "titanic, tensorflow, explainability, fairness, patra",
    "author": "Isuru Gamage",
    "input_type": "Tabular",
    "category": "classification",
    "input_data": "https://www.kaggle.com/datasets/monisamir/titanic-disaster-analysis",
    "output_data": "https://github.iu.edu/d2i/dockerhub/tensorflow/titanic_modelv01",
    "foundational_model": "None",
    "ai_model": {
        "name": "Survived prediction tensorflow model",
        "version": "0.1",
        "description": "Census classification problem using Tensorflow Neural Network using the Titanic Disaster Analysis Dataset",
        "owner": "Isuru Gamage",
        "location": "https://github.iu.edu/d2i/sales/tensorflow_model",
        "license": "BSD-3 Clause",
        "framework": "tensorflow",
        "model_type": "dnn",
        "test_accuracy": 0.7765362858772278,
        "foundational_model": "None",
        "model_structure": {
            "module": "keras",
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    }
                },
                "layers": [
                    {
                        "module": "keras.layers",
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                7
                            ],
                            "dtype": "float32",
                            "name": "input_layer_1"
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                7
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                64
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                128
                            ]
                        }
                    }
                ],
                "build_input_shape": [
                    7
                ]
            },
            "build_config": {
                "input_shape": [
                    7
                ]
            },
            "compile_config": {
                "optimizer": {
                    "module": "keras.optimizers",
                    "class_name": "Adam",
                    "config": {
                        "name": "adam",
                        "learning_rate": 0.0010000000474974513,
                        "ema_momentum": 0.99,
                        "beta_1": 0.9,
                        "beta_2": 0.999,
                        "epsilon": 1e-07
                    }
                },
                "loss": "binary_crossentropy",
                "metrics": [
                    "accuracy"
                ],
                "steps_per_execution": 1
            }
        },
        "metrics": {
            "Test loss": 0.4512645900249481,
            "Epochs": 100,
            "Batch Size": 32,
            "Optimizer": "Adam",
            "Learning Rate": 0.0001,
            "Input Shape": [
                712,
                7
            ]
        }
    },
    "bias_analysis": {
        "demographic_parity_diff": 0.8420289855072464,
        "equal_odds_difference": 0.798951048951049
    },
    "xai_analysis": {
        "Sex": 0.22753063505213894,
        "Fare": 0.054301415441646475,
        "Age": 0.03889573261709441,
        "SibSp": 0.037773687361606544,
        "Parch": 0.0218172043377445,
        "Embarked": 0.01248318962610903,
        "Pclass": 0.00951781880749123
    },
    "model_requirements": [
        "absl-py==2.1.0",
        "anyio==4.4.0",
        "argon2-cffi-bindings==21.2.0",
        "argon2-cffi==23.1.0",
        "arrow==1.3.0",
        "asttokens==2.4.1",
        "astunparse==1.6.3",
        "async-lru==2.0.4",
        "attrs==23.1.0",
        "autocommand==2.2.2",
        "babel==2.16.0",
        "backports.tarfile==1.2.0",
        "beautifulsoup4==4.12.3",
        "bleach==6.1.0",
        "certifi==2024.8.30",
        "cffi==1.17.1",
        "charset-normalizer==3.3.2",
        "cloudpickle==3.0.0",
        "colorama==0.4.6",
        "comm==0.2.2",
        "debugpy==1.8.5",
        "decorator==5.1.1",
        "defusedxml==0.7.1",
        "et-xmlfile==1.1.0",
        "executing==2.1.0",
        "fastjsonschema==2.20.0",
        "flatbuffers==24.3.25",
        "fqdn==1.5.1",
        "gast==0.6.0",
        "google-pasta==0.2.0",
        "grpcio==1.66.1",
        "h11==0.14.0",
        "h5py==3.11.0",
        "httpcore==1.0.5",
        "httpx==0.27.2",
        "idna==3.8",
        "importlib-metadata==8.0.0",
        "importlib-resources==6.4.0",
        "inflect==7.3.1",
        "ipykernel==6.29.5",
        "ipython==8.27.0",
        "isoduration==20.11.0",
        "jaraco.context==5.3.0",
        "jaraco.functools==4.0.1",
        "jaraco.text==3.12.1",
        "jedi==0.19.1",
        "jinja2==3.1.4",
        "joblib==1.4.2",
        "json5==0.9.25",
        "jsonpointer==3.0.0",
        "jsonschema-specifications==2023.12.1",
        "jsonschema==4.18.6",
        "jupyter-client==8.6.2",
        "jupyter-core==5.7.2",
        "jupyter-events==0.10.0",
        "jupyter-lsp==2.2.5",
        "jupyter-server-terminals==0.5.3",
        "jupyter-server==2.14.2",
        "jupyterlab-pygments==0.3.0",
        "jupyterlab-server==2.27.3",
        "jupyterlab==4.2.5",
        "keras==3.5.0",
        "libclang==18.1.1",
        "llvmlite==0.43.0",
        "markdown-it-py==3.0.0",
        "markdown==3.7",
        "markupsafe==2.1.5",
        "matplotlib-inline==0.1.7",
        "mdurl==0.1.2",
        "mistune==3.0.2",
        "ml-dtypes==0.4.0",
        "more-itertools==10.3.0",
        "namex==0.0.8",
        "nbclient==0.10.0",
        "nbconvert==7.16.4",
        "nbformat==5.10.4",
        "nest-asyncio==1.6.0",
        "notebook-shim==0.2.4",
        "notebook==7.2.2",
        "numba==0.60.0",
        "numpy==1.26.4",
        "openpyxl==3.1.5",
        "opt-einsum==3.3.0",
        "optree==0.12.1",
        "overrides==7.7.0",
        "packaging==24.1",
        "pandas==2.2.2",
        "pandocfilters==1.5.1",
        "parso==0.8.4",
        "patra-model-card==0.3",
        "pip==24.2",
        "platformdirs==4.3.2",
        "prometheus-client==0.20.0",
        "prompt-toolkit==3.0.47",
        "protobuf==4.25.4",
        "psutil==6.0.0",
        "pure-eval==0.2.3",
        "pycparser==2.22",
        "pygments==2.18.0",
        "pyrsistent==0.19.3",
        "python-dateutil==2.9.0.post0",
        "python-json-logger==2.0.7",
        "pytz==2024.1",
        "pywin32==306",
        "pywinpty==2.0.13",
        "pyyaml==6.0.2",
        "pyzmq==26.2.0",
        "referencing==0.35.1",
        "requests==2.32.3",
        "rfc3339-validator==0.1.4",
        "rfc3986-validator==0.1.1",
        "rich==13.8.1",
        "rpds-py==0.20.0",
        "scikit-learn==1.5.1",
        "scipy==1.13.1",
        "send2trash==1.8.3",
        "setuptools==74.1.2",
        "six==1.16.0",
        "slicer==0.0.8",
        "sniffio==1.3.1",
        "soupsieve==2.6",
        "stack-data==0.6.3",
        "tensorboard-data-server==0.7.2",
        "tensorboard==2.17.1",
        "tensorflow-intel==2.17.0",
        "tensorflow==2.17.0",
        "termcolor==2.4.0",
        "terminado==0.18.1",
        "threadpoolctl==3.5.0",
        "tinycss2==1.3.0",
        "tomli==2.0.1",
        "tornado==6.4.1",
        "tqdm==4.66.5",
        "traitlets==5.14.3",
        "typeguard==4.3.0",
        "types-python-dateutil==2.9.0.20240906",
        "typing-extensions==4.12.2",
        "tzdata==2024.1",
        "uri-template==1.3.0",
        "urllib3==2.2.2",
        "wcwidth==0.2.13",
        "webcolors==24.8.0",
        "webencodings==0.5.1",
        "websocket-client==1.8.0",
        "werkzeug==3.0.4",
        "wheel==0.44.0",
        "wrapt==1.16.0",
        "zipp==3.19.2"
    ]
}