{
    "name": "UCI Adult Data Analysis model using Tensorflow",
    "version": "0.1",
    "short_description": "UCI Adult Data analysis using Tensorflow for demonstration of Patra Model Cards.",
    "full_description": "We have trained a ML model using the tensorflow framework to predict income for the UCI Adult Dataset. We leverage this data to run the Patra model cards to capture metadata about the model as well as fairness and explainability metrics.",
    "keywords": "uci adult, tensorflow, explainability, fairness, patra",
    "author": "Sachith Withana",
    "input_type": "Tabular",
    "category": "classification",
    "input_data": "https://archive.ics.uci.edu/dataset/2/adult",
    "output_data": "https://github.iu.edu/d2i/dockerhub/tensorflow/adult_modelv01",
    "ai_model": {
        "name": "Income prediction tensorflow model",
        "version": "0.1",
        "description": "Census classification problem using Tensorflow Neural Network using the UCI Adult Dataset",
        "owner": "Sachith Withana",
        "location": "https://github.iu.edu/d2i/uci_adult/tensorflow_model",
        "license": "BSD-3 Clause",
        "framework": "tensorflow",
        "model_type": "dnn",
        "test_accuracy": 0.801627516746521,
        "foundational_model": "None",
        "model_structure": {
            "module": "keras",
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    }
                },
                "layers": [
                    {
                        "module": "keras.layers",
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                100
                            ],
                            "dtype": "float32",
                            "name": "input_layer"
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                100
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                64
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                128
                            ]
                        }
                    },
                    {
                        "module": "keras.layers",
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                }
                            },
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform"
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros"
                            }
                        },
                        "build_config": {
                            "input_shape": [
                                64
                            ]
                        }
                    }
                ],
                "build_input_shape": [
                    100
                ]
            },
            "build_config": {
                "input_shape": [
                    100
                ]
            },
            "compile_config": {
                "optimizer": {
                    "module": "keras.optimizers",
                    "class_name": "Adam",
                    "config": {
                        "name": "adam",
                        "learning_rate": 0.0010000000474974513,
                        "ema_momentum": 0.99,
                        "beta_1": 0.9,
                        "beta_2": 0.999,
                        "epsilon": 1e-07
                    }
                },
                "loss": "binary_crossentropy",
                "metrics": [
                    "accuracy"
                ],
                "steps_per_execution": 1
            }
        },
        "metrics": {
            "Test loss": 0.5022369027137756,
            "Epochs": 100,
            "Batch Size": 32,
            "Optimizer": "Adam",
            "Learning Rate": 0.0001,
            "Input Shape": "(26048, 100)"
        }
    },
    "bias_analysis": {
        "demographic_parity_diff": 0.04692786199540633,
        "equal_odds_difference": 0.03891850625813942
    },
    "xai_analysis": {
        "capital-gain": 0.16518183764898114,
        "fnlwgt": 0.02944359259679913,
        "age": 0.0018410406613515496,
        "hours-per-week": 0.0014073482238584102,
        "martial-status_ Married-civ-spouse": 0.0007648632302880298,
        "occupation_ Exec-managerial": 0.000614370765785378,
        "relationship_ Not-in-family": 0.0005974954366683956,
        "martial-status_ Never-married": 0.0005050689168274403,
        "education_ Bachelors": 0.00039388835637105816,
        "education-num": 0.000368746817111969
    }
}